In [2]:
import pandas as pd
import numpy as np
data=pd.read_csv("test_internship.csv")

In [3]:
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
data.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
#Identify categorial columns
categorical_columns=data.select_dtypes(include=['object','category']).columns.tolist()
print(categorical_columns)
#Identify numerical columns
numerical_columns=data.select_dtypes(include=['int64','float64']).columns.tolist()
print(numerical_columns)

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']
['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [7]:
columns_used = ['PassengerId','Pclass', 'Age', 'SibSp', 'Parch', 'Fare']
selected_columns=data.loc[:,columns_used]
selected_columns.head(5)

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0          892       3  34.5      0      0   7.8292
1          893       3  47.0      1      0   7.0000
2          894       2  62.0      0      0   9.6875
3          895       3  27.0      0      0   8.6625
4          896       3  22.0      1      1  12.2875

In [8]:
column_mean = selected_columns.mean()
print("Mean for each column:",column_mean)

Mean for each column: PassengerId    1100.500000
Pclass            2.265550
Age              30.272590
SibSp             0.447368
Parch             0.392344
Fare             35.627188
dtype: float64

In [9]:
column_median = selected_columns.median()
print("Median for each column:",column_median)

Median for each column: PassengerId    1100.5000
Pclass            3.0000
Age              27.0000
SibSp             0.0000
Parch             0.0000
Fare             14.4542
dtype: float64

In [10]:
column_mode = selected_columns.mode()
print("Mode for each column:",column_mode)

Mode for each column:      PassengerId  Pclass   Age  SibSp  Parch  Fare
0            892     3.0  21.0    0.0    0.0  7.75
1            893     NaN  24.0    NaN    NaN   NaN
2            894     NaN   NaN    NaN    NaN   NaN
3            895     NaN   NaN    NaN    NaN   NaN
4            896     NaN   NaN    NaN    NaN   NaN
..           ...     ...   ...    ...    ...   ...
413         1305     NaN   NaN    NaN    NaN   NaN
414         1306     NaN   NaN    NaN    NaN   NaN
415         1307     NaN   NaN    NaN    NaN   NaN
416         1308     NaN   NaN    NaN    NaN   NaN
417         1309     NaN   NaN    NaN    NaN   NaN

[418 rows x 6 columns]

In [11]:
column_std_deviation = selected_columns.std()
print("Standard Deviation for each column:",column_std_deviation)

Standard Deviation for each column: PassengerId    120.810458
Pclass           0.841838
Age             14.181209
SibSp            0.896760
Parch            0.981429
Fare            55.907576
dtype: float64

In [12]:
selected_columns.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200